In [1]:
pip install pyodbc

Collecting pyodbc
  Downloading pyodbc-5.2.0-cp311-cp311-win_amd64.whl.metadata (2.8 kB)
Downloading pyodbc-5.2.0-cp311-cp311-win_amd64.whl (68 kB)
   ---------------------------------------- 0.0/68.9 kB ? eta -:--:--
   ----- ---------------------------------- 10.2/68.9 kB ? eta -:--:--
   ----------------------------------- ---- 61.4/68.9 kB 648.1 kB/s eta 0:00:01
   ----------------------------------- ---- 61.4/68.9 kB 648.1 kB/s eta 0:00:01
   ---------------------------------------- 68.9/68.9 kB 469.0 kB/s eta 0:00:00
Installing collected packages: pyodbc
Successfully installed pyodbc-5.2.0
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.0 -> 25.1.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [32]:
import pyodbc
import pandas as pd

In [34]:
!pip install sqlalchemy

Collecting sqlalchemy
  Downloading sqlalchemy-2.0.41-cp311-cp311-win_amd64.whl.metadata (9.8 kB)
Collecting greenlet>=1 (from sqlalchemy)
  Downloading greenlet-3.2.3-cp311-cp311-win_amd64.whl.metadata (4.2 kB)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\manisha\appdata\roaming\python\python311\site-packages (from sqlalchemy) (4.14.0)
Downloading sqlalchemy-2.0.41-cp311-cp311-win_amd64.whl (2.1 MB)
   ---------------------------------------- 0.0/2.1 MB ? eta -:--:--
   - -------------------------------------- 0.1/2.1 MB 3.2 MB/s eta 0:00:01
   -------- ------------------------------- 0.5/2.1 MB 7.0 MB/s eta 0:00:01
   ------------- -------------------------- 0.7/2.1 MB 7.6 MB/s eta 0:00:01
   ------------------------ --------------- 1.3/2.1 MB 8.1 MB/s eta 0:00:01
   ----------------------------------- ---- 1.9/2.1 MB 9.1 MB/s eta 0:00:01
   ---------------------------------------  2.1/2.1 MB 9.6 MB/s eta 0:00:01
   ---------------------------------------- 2.1/2.1 MB 7.9 MB/s eta 0:00:00
Downloading greenlet-3.2.3-cp311-cp311-win_amd64.whl (297 kB)
   ---------------------------------------- 0.0/297.0 kB ? eta -:--:--
   ---------------------------------------- 297.0/297.0 kB 9.0 MB/s eta 0:00:00
Installing collected packages: greenlet, sqlalchemy
Successfully installed greenlet-3.2.3 sqlalchemy-2.0.41

[notice] A new release of pip is available: 24.0 -> 25.1.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [2]:
pyodbc.drivers()

['SQL Server',
 'SQL Server Native Client RDA 11.0',
 'ODBC Driver 17 for SQL Server',
 'Microsoft Access Driver (*.mdb, *.accdb)',
 'Microsoft Excel Driver (*.xls, *.xlsx, *.xlsm, *.xlsb)',
 'Microsoft Access Text Driver (*.txt, *.csv)',
 'Microsoft Access dBASE Driver (*.dbf, *.ndx, *.mdx)']

In [ ]:

DRIVER_NAME='ODBC Driver 17 for SQL Server',
USERNAME='sa',
SERVER_NAME = 'DESKTOP-FIQ4FDL\SQLEXPRESS03',
PASSWORD='manisha123',

In [21]:
connection_string = f"""
DRIVER={{{DRIVER_NAME}}};
SERVER={SERVER_NAME};
UID={USERNAME};
PWD={PASSWORD};
DATABASE=master;

"""

In [4]:
DRIVER_NAME = 'ODBC Driver 17 for SQL Server'
SERVER_NAME = 'DESKTOP-FIQ4FDL\\SQLEXPRESS03'  
USERNAME = 'sa'
PASSWORD = 'manisha123'

In [5]:

# Build connection string (connecting to master DB)
connection_string = (
    f"DRIVER={{{DRIVER_NAME}}};"
    f"SERVER={SERVER_NAME};"
    f"UID={USERNAME};"
    f"PWD={PASSWORD};"
)

# Try connecting with autocommit enabled
try:
    conn = pyodbc.connect(connection_string, autocommit=True)
    cursor = conn.cursor()
    print("✅ Connected to SQL Server successfully.")
except Exception as e:
    print(" Connection failed:", e)

 Connection failed: name 'pyodbc' is not defined

In [ ]:
try:
    cursor.execute("CREATE DATABASE sqlpythondb;")
    print("✅ Database 'sqlpythondb' created successfully with autocommit.")
except Exception as e:
    print(" Failed to create database:", e)

❌ Failed to create database: ('42000', "[42000] [Microsoft][ODBC Driver 17 for SQL Server][SQL Server]Database 'sqlpythondb' already exists. Choose a different database name. (1801) (SQLExecDirectW)")

In [2]:
try:
    cursor.execute("SELECT name FROM sys.databases;")
    databases = cursor.fetchall()
    db_list = [row[0] for row in databases]
    print("Available Databases:")
    for db in db_list:
        print(f"  - {db}")

    # Check if your DB is in the list
    if 'sqlpythondb' in db_list:
        print("'sqlpythondb' exists.")
    else:
        print("'sqlpythondb' NOT found.")
except Exception as e:
    print(" Error fetching databases:", e)

 Error fetching databases: name 'cursor' is not defined

In [86]:
cust=r"c:\Users\Manisha\Downloads\replaced_customer.csv"

customer=pd.read_csv(cust)

customer

,customer_id,name,email,phone,address,registration_date,loyalty_status
0,1,Michelle Kidd,vayala@example.net,(619) 723-4258,"USNS Santiago, FPO AE 80872",25-01-2025,Gold
1,2,Brad Newton,taylorcatherine@example.net,(537) 674-1158,"38783 Oliver Street, West Kristenborough, MT 9...",13-07-2023,Silver
2,3,Larry Torres,dsanchez@example.net,(810) 256-4505,"6845 Steele Turnpike, West Erikabury, UT 37487",18-08-2023,Bronze
3,4,Kimberly Price,jessicaknight@example.com,(423) 222-9779,"1631 Alexis Meadows, Lake Amanda, CA 75179",08-12-2024,Gold
4,5,Matthew Phillips,qwilliams@example.com,(220) 763-3522,"2274 Williams Heights Suite 895, Andersonhaven...",03-02-2024,Gold
...,...,...,...,...,...,...,...
995,996,Jerry Mcdaniel,walkerlisa@example.net,(638) 989-9441,"34746 Smith Gateway, New Sarah, AS 12715",10-02-2025,Silver
996,997,Jodi Simpson,eric24@example.org,(483) 625-2940,"2876 Tucker Road Suite 947, North Tommyborough...",18-04-2024,Bronze
997,998,Crystal Brown,pshaffer@example.net,(390) 747-3088,"095 Janice Forest Suite 570, Boltonmouth, DE 7...",30-08-2024,Bronze
998,999,Gregory Duarte,caitlindunlap@example.org,(257) 409-8196,"Unit 6377 Box 7662, DPO AP 03300",16-05-2024,Gold
999,1000,Jason Walls,michael42@example.com,(692) 333-6880,"95002 Bruce Rue, Camachoport, MH 58723",10-12-2024,Bronze

In [31]:
ord=r"C:\Users\Manisha\Downloads\order_data 1.csv"

orders=pd.read_csv(ord)

orders

,order_id,customer_id,order_date,order_amount,order_status,product_category
0,892a07a4-d252-4775-85e0-73077143e1c6,966,2024-11-27,317.64,Cancelled,Home & Garden
1,ae160758-e187-47b2-9350-032f88f55491,345,2023-03-27,645.87,Completed,Home & Garden
2,7c50456e-6123-45cc-aa19-128bef3754d6,503,2024-03-31,880.86,Pending,Clothing
3,c788b56b-3716-4cd9-a827-d4dc401ba00c,385,2023-08-09,876.83,Cancelled,Home & Garden
4,925ab5b1-adb1-4302-a70b-1c2db724e02b,817,2023-04-19,264.53,Pending,Home & Garden
...,...,...,...,...,...,...
1995,cb6f0f6b-3d4b-402c-ba9e-a8e666422d97,799,2023-11-20,634.62,Cancelled,Clothing
1996,900fdea4-fd87-486d-bc20-26d045767ed8,692,2023-07-20,945.97,Cancelled,Electronics
1997,4550ccfe-18c1-45d5-8c31-0edf1e3d9fa3,695,2024-01-06,229.99,Cancelled,Home & Garden
1998,dd19b028-dfa2-4eda-a66f-44f5401ef27e,502,2023-02-05,596.65,Completed,Electronics
1999,5e32ff66-d3dd-48ad-8e47-cd71bb2e97ea,348,2024-11-02,238.69,Completed,Books

In [38]:
customer.columns

Index(['name', 'email', 'phone', 'address', 'registration_date',
       'loyalty_status'],
      dtype='object')

In [50]:
orders.columns

Index(['order_id', 'customer_id', 'order_date', 'order_amount', 'order_status',
       'product_category'],
      dtype='object')

In [19]:
import pyodbc

# Connection details
DRIVER_NAME = "ODBC Driver 17 for SQL Server"
SERVER_NAME = "DESKTOP-FIQ4FDL\\SQLEXPRESS03"  
USERNAME = "sa"
PASSWORD = "manisha123"  
DATABASE_NAME = "sqlpythondb"  

# Build connection string
connection_string = (
    f"DRIVER={{{DRIVER_NAME}}};"
    f"SERVER={SERVER_NAME};"
    f"DATABASE={DATABASE_NAME};" 
    f"UID={USERNAME};"
    f"PWD={PASSWORD};"
)

# Connect with autocommit
try:
    conn = pyodbc.connect(connection_string, autocommit=True)
    cursor = conn.cursor()
    print(f" Connected to SQL Server — Database: {DATABASE_NAME}")
except Exception as e:
    print(" Connection failed:", e)

 Connected to SQL Server — Database: sqlpythondb

In [24]:
drop1= """
drop table orders; """

cursor.execute(drop1)

In [29]:
drop= """
drop table customers; """

cursor.execute(drop)

In [27]:
drop= """
drop table transactions; """

cursor.execute(drop)

In [34]:
cursor.execute("SELECT DB_NAME() AS CurrentDatabase")
database_name = cursor.fetchone()[0]
print("Current Database:", database_name)

Current Database: sqlpythondb

In [30]:
create_table_sql = """
CREATE TABLE Customers(
    customer_id int primary key,
    name varchar(255),
    email varchar(255),
    phone nvarchar(50),
    address nvarchar(255),
    registration_date DATE,
    loyalty_status VARCHAR(50)
);
CREATE TABLE orders (
    order_id VARCHAR(255) primary key,
    customer_id INT,
    order_date DATE,
    order_amount float,
    order_status VARCHAR(50),
    product_category VARCHAR(100)
);
create table transactions(
                        transaction_id int primary key,
                        customer_id int,
                        amount float,
                        transaction_date date,
                        product_category varchar(max),
                        payment_method varchar(max),
                        store_location varchar(max),
                        FOREIGN KEY (customer_id) REFERENCES customers(customer_id)
                        );

"""

cursor.execute(create_table_sql)
print("'CUSTOMER' AND 'ORDERS  AND transations' table created.")

'CUSTOMER' AND 'ORDERS  AND transations' table created.

In [33]:
# --- Check Customers Table ---
print("\n  Checking 'Customers' Table:")
cursor.execute("SELECT * FROM Customers")
customers = cursor.fetchall()
customer_columns = [col[0] for col in cursor.description]
print("  Columns:", customer_columns)
for row in customers[:5]:
    print(row)

# --- Check Orders Table ---
print("\n Checking 'Orders' Table:")
cursor.execute("SELECT * FROM Orders")
orders = cursor.fetchall()
order_columns = [col[0] for col in cursor.description]
print("Columns:", order_columns)
for row in orders[:5]:
    print(row)

  Checking 'Customers' Table:
  Columns: ['customer_id', 'name', 'email', 'phone', 'address', 'registration_date', 'loyalty_status']

 Checking 'Orders' Table:
Columns: ['order_id', 'customer_id', 'order_date', 'order_amount', 'order_status', 'product_category']

In [38]:
cust=r"c:\Users\Manisha\Downloads\replaced_customer.csv"

customer=pd.read_csv(cust)

customer.head(5)

,customer_id,name,email,phone,address,registration_date,loyalty_status
0,1,Michelle Kidd,vayala@example.net,(619) 723-4258,"USNS Santiago, FPO AE 80872",25-01-2025,Gold
1,2,Brad Newton,taylorcatherine@example.net,(537) 674-1158,"38783 Oliver Street, West Kristenborough, MT 9...",13-07-2023,Silver
2,3,Larry Torres,dsanchez@example.net,(810) 256-4505,"6845 Steele Turnpike, West Erikabury, UT 37487",18-08-2023,Bronze
3,4,Kimberly Price,jessicaknight@example.com,(423) 222-9779,"1631 Alexis Meadows, Lake Amanda, CA 75179",08-12-2024,Gold
4,5,Matthew Phillips,qwilliams@example.com,(220) 763-3522,"2274 Williams Heights Suite 895, Andersonhaven...",03-02-2024,Gold

In [39]:
ord=r"C:\Users\Manisha\Downloads\order_data 1.csv"

orders=pd.read_csv(ord)

orders

,order_id,customer_id,order_date,order_amount,order_status,product_category
0,892a07a4-d252-4775-85e0-73077143e1c6,966,2024-11-27,317.64,Cancelled,Home & Garden
1,ae160758-e187-47b2-9350-032f88f55491,345,2023-03-27,645.87,Completed,Home & Garden
2,7c50456e-6123-45cc-aa19-128bef3754d6,503,2024-03-31,880.86,Pending,Clothing
3,c788b56b-3716-4cd9-a827-d4dc401ba00c,385,2023-08-09,876.83,Cancelled,Home & Garden
4,925ab5b1-adb1-4302-a70b-1c2db724e02b,817,2023-04-19,264.53,Pending,Home & Garden
...,...,...,...,...,...,...
1995,cb6f0f6b-3d4b-402c-ba9e-a8e666422d97,799,2023-11-20,634.62,Cancelled,Clothing
1996,900fdea4-fd87-486d-bc20-26d045767ed8,692,2023-07-20,945.97,Cancelled,Electronics
1997,4550ccfe-18c1-45d5-8c31-0edf1e3d9fa3,695,2024-01-06,229.99,Cancelled,Home & Garden
1998,dd19b028-dfa2-4eda-a66f-44f5401ef27e,502,2023-02-05,596.65,Completed,Electronics
1999,5e32ff66-d3dd-48ad-8e47-cd71bb2e97ea,348,2024-11-02,238.69,Completed,Books

In [41]:
customer.columns

Index(['customer_id', 'name', 'email', 'phone', 'address', 'registration_date',
       'loyalty_status'],
      dtype='object')

In [42]:
orders.columns

Index(['order_id', 'customer_id', 'order_date', 'order_amount', 'order_status',
       'product_category'],
      dtype='object')

In [11]:
import pyodbc

# Connection details
DRIVER_NAME = "ODBC Driver 17 for SQL Server"
SERVER_NAME = "DESKTOP-FIQ4FDL\\SQLEXPRESS03"  
USERNAME = "sa"
PASSWORD = "manisha123"  
DATABASE_NAME = "sqlpythondb"  

# Build connection string
connection_string = (
    f"DRIVER={{{DRIVER_NAME}}};"
    f"SERVER={SERVER_NAME};"
    f"DATABASE={DATABASE_NAME};"  
    f"UID={USERNAME};"
    f"PWD={PASSWORD};"
)

# Connect with autocommit
try:
    conn = pyodbc.connect(connection_string, autocommit=True)
    cursor = conn.cursor()
    print(f" Connected to SQL Server — Database: {DATABASE_NAME}")
except Exception as e:
    print(" Connection failed:", e)

 Connected to SQL Server — Database: sqlpythondb

In [43]:
# Ensure registration_date is parsed properly
customer['registration_date'] = pd.to_datetime(customer['registration_date'], errors='coerce')

# Now insert data
for index, row in customer.iterrows():
    cursor.execute("""
        INSERT INTO Customers (customer_id, name, email, phone, address, registration_date, loyalty_status)
        VALUES (?, ?, ?, ?, ?, ?, ?)
    """, 
    int(row['customer_id']),
    row['name'],
    row['email'],
    row['phone'],
    row['address'],
    row['registration_date'].strftime('%Y-%m-%d') if not pd.isna(row['registration_date']) else None,
    row['loyalty_status'])

conn.commit()
print(" Customers inserted.")

C:\Users\Manisha\AppData\Local\Temp\ipykernel_23256\3261394641.py:2: UserWarning: Parsing dates in %d-%m-%Y format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  customer['registration_date'] = pd.to_datetime(customer['registration_date'], errors='coerce')

 Customers inserted.

In [45]:
print(type(orders))

<class 'pandas.core.frame.DataFrame'>

In [54]:
truncate= """
truncate table orders; """

cursor.execute(truncate)

In [ ]:
orders['order_date'] = pd.to_datetime(orders['order_date'], errors='coerce')

In [55]:
for index, row in orders.iterrows():
    cursor.execute("""
        INSERT INTO orders (order_id, customer_id, order_date, order_amount, order_status, product_category)
        VALUES (?, ?, ?, ?, ?, ?)
    """, 
    row['order_id'],
    row['customer_id'],
    row['order_date'].strftime('%Y-%m-%d') if pd.notnull(row['order_date']) else None,
    row['order_amount'],
    row['order_status'],
    row['product_category']
    )

conn.commit()
print("Orders inserted successfully into the database.")

Orders inserted successfully into the database.

In [57]:
tran=r"C:\Users\Manisha\Downloads\transaction_data.csv"
transaction=pd.read_csv(tran)
transaction.head()

,transaction_id,customer_id,amount,transaction_date,product_category,payment_method,store_location
0,1,565,2992.47,2025-03-10 01:20:54,Sports,Debit Card,New York
1,2,323,2041.87,2025-01-02 15:24:19,Clothing,Cash,New York
2,3,398,107.35,2025-02-16 03:49:01,Beauty,Debit Card,Online
3,4,19,NaN,2025-04-30 15:26:23,Sports,Debit Card,Los Angeles
4,5,547,3063.28,2025-06-14 04:28:53,Clothing,PayPal,Los Angeles

In [58]:
transaction.columns

Index(['transaction_id', 'customer_id', 'amount', 'transaction_date',
       'product_category', 'payment_method', 'store_location'],
      dtype='object')

In [72]:
transaction.isnull().any()

transaction_id      False
customer_id         False
amount               True
transaction_date    False
product_category    False
payment_method      False
store_location      False
dtype: bool

In [73]:
transaction.isnull().sum()

transaction_id       0
customer_id          0
amount              50
transaction_date     0
product_category     0
payment_method       0
store_location       0
dtype: int64

In [74]:
transaction['amount']=transaction['amount'].fillna(0.00)

In [75]:
transaction.isnull().sum()

transaction_id      0
customer_id         0
amount              0
transaction_date    0
product_category    0
payment_method      0
store_location      0
dtype: int64

In [80]:
transaction.to_csv('transaction_new.csv')

In [82]:
tran1=r"C:\Users\Manisha\Downloads\transaction_new.csv"
transaction1=pd.read_csv(tran1)
transaction1.head()

,Unnamed: 0,transaction_id,customer_id,amount,transaction_date,product_category,payment_method,store_location
0,0,1,565,2992.47,2025-03-10,Sports,Debit Card,New York
1,1,2,323,2041.87,2025-01-02,Clothing,Cash,New York
2,2,3,398,107.35,2025-02-16,Beauty,Debit Card,Online
3,3,4,19,0.00,2025-04-30,Sports,Debit Card,Los Angeles
4,4,5,547,3063.28,2025-06-14,Clothing,PayPal,Los Angeles

In [65]:
transaction['transaction_date'] = pd.to_datetime(transaction['transaction_date']).dt.date

In [83]:
for index, row in transaction1.iterrows():
    cursor.execute("SELECT COUNT(*) FROM transactions WHERE transaction_id = ?", (row['transaction_id'],))
    if cursor.fetchone()[0] == 0:
        cursor.execute("""
            INSERT INTO transactions (
                transaction_id, customer_id, amount, transaction_date,
                product_category, payment_method, store_location
            ) VALUES (?, ?, ?, ?, ?, ?, ?)
        """, (
            int(row['transaction_id']),
            int(row['customer_id']),
            float(row['amount']),
            row['transaction_date'],
            row['product_category'],
            row['payment_method'],
            row['store_location']
        ))

conn.commit()
print("TRANSACTIONS inserted (new records only).")

TRANSACTIONS inserted (new records only).

In [87]:

print("\n  Checking 'Customers' Table:")
cursor.execute("SELECT * FROM Customers")
customers = cursor.fetchall()
customer_columns = [col[0] for col in cursor.description]
print("  Columns:", customer_columns)
for row in customers[:5]:
    print(row)


print("\n Checking 'Orders' Table:")
cursor.execute("SELECT * FROM Orders")
orders = cursor.fetchall()
order_columns = [col[0] for col in cursor.description]
print("Columns:", order_columns)
for row in orders[:5]:
    print(row)

print("\n Checking 'transactions' Table:")
cursor.execute("SELECT * FROM transactions")
orders = cursor.fetchall()
order_columns = [col[0] for col in cursor.description]
print("Columns:", order_columns)
for row in orders[:5]:
    print(row)

  Checking 'Customers' Table:
  Columns: ['customer_id', 'name', 'email', 'phone', 'address', 'registration_date', 'loyalty_status']
(1, 'Michelle Kidd', 'vayala@example.net', '(619) 723-4258', 'USNS Santiago, FPO AE 80872', datetime.date(2025, 1, 25), 'Gold')
(2, 'Brad Newton', 'taylorcatherine@example.net', '(537) 674-1158', '38783 Oliver Street, West Kristenborough, MT 99752', datetime.date(2023, 7, 13), 'Silver')
(3, 'Larry Torres', 'dsanchez@example.net', '(810) 256-4505', '6845 Steele Turnpike, West Erikabury, UT 37487', datetime.date(2023, 8, 18), 'Bronze')
(4, 'Kimberly Price', 'jessicaknight@example.com', '(423) 222-9779', '1631 Alexis Meadows, Lake Amanda, CA 75179', datetime.date(2024, 12, 8), 'Gold')
(5, 'Matthew Phillips', 'qwilliams@example.com', '(220) 763-3522', '2274 Williams Heights Suite 895, Andersonhaven, OR 80565', datetime.date(2024, 2, 3), 'Gold')

 Checking 'Orders' Table:
Columns: ['order_id', 'customer_id', 'order_date', 'order_amount', 'order_status', 'product_category']
('00104da6-42bf-4f44-81d4-c4435385b8c6', 27, datetime.date(2023, 5, 9), 801.02, 'Pending', 'Toys')
('00107b61-829c-489e-9170-378068dd46b6', 709, datetime.date(2023, 5, 22), 293.81, 'Pending', 'Home & Garden')
('00240607-c104-4303-aa19-a49b88e234b1', 178, datetime.date(2024, 6, 2), 431.1, 'Cancelled', 'Electronics')
('003ee1e2-5f82-492b-9400-651073ced890', 381, datetime.date(2024, 1, 21), 193.48, 'Pending', 'Electronics')
('008dc60e-b788-44e3-b6b2-097161e15072', 807, datetime.date(2023, 4, 1), 539.69, 'Completed', 'Toys')

 Checking 'transactions' Table:
Columns: ['transaction_id', 'customer_id', 'amount', 'transaction_date', 'product_category', 'payment_method', 'store_location']
(1, 565, 2992.47, datetime.date(2025, 3, 10), 'Sports', 'Debit Card', 'New York')
(2, 323, 2041.87, datetime.date(2025, 1, 2), 'Clothing', 'Cash', 'New York')
(3, 398, 107.35, datetime.date(2025, 2, 16), 'Beauty', 'Debit Card', 'Online')
(4, 19, 0.0, datetime.date(2025, 4, 30), 'Sports', 'Debit Card', 'Los Angeles')
(5, 547, 3063.28, datetime.date(2025, 6, 14), 'Clothing', 'PayPal', 'Los Angeles')

COMPLETED WITH SSMS CONNECTIONS,CREATING A NEW DATABASE AND INSERTING A TABLE AND ROWS